## Index DataFrame

In [68]:
import pandas as pd

In [69]:
prices_dict = {
    "fruits": ["apples", "oranges", "bananas", "strawberries"],
    "prices": [1.5, 2, 2.5, 3],
    "suppliers": ["supplier1", "supplier2", "supplier4", "supplier3"],    
}

prices_df = pd.DataFrame(prices_dict, index = [1,2,3,4])
prices_df

         fruits  prices  suppliers
1        apples     1.5  supplier1
2       oranges     2.0  supplier2
3       bananas     2.5  supplier4
4  strawberries     3.0  supplier3

### Select Columns

#### Select Single Column (returns a Series Object)

In [70]:
## select single column - square bracket notation:
prices = prices_df[ 'prices' ]
print(type(prices))

prices

<class 'pandas.core.series.Series'>

1    1.5
2    2.0
3    2.5
4    3.0
Name: prices, dtype: float64

In [71]:
## select single column
# attribute (dot) notation:
prices = prices_df.prices
print(type(prices))

prices

<class 'pandas.core.series.Series'>

1    1.5
2    2.0
3    2.5
4    3.0
Name: prices, dtype: float64

#### square bracket vs dot notation
Note that square bracket notation is more canonical (can be used for 1 or multiple columns selection) and allows for any string to be used as selector. I.e you can't use the dot notation, if the column name contains spaces, or is a reserverd word (like max, min, etc.)

In [72]:
demo_df = pd.DataFrame([[1,2,3],[4,5,6]], columns=['col 1', 'col 2', 'col 3'])

# the line bellow will raise an error:
# demo_df.'col 1'

# but next is ok:
demo_df['col 1']

0    1
1    4
Name: col 1, dtype: int64

### Select List of Columns

Note, that the columns will be selected in the order specified in the list

In [73]:
prices_df[['prices', 'fruits']]

   prices        fruits
1     1.5        apples
2     2.0       oranges
3     2.5       bananas
4     3.0  strawberries

The returned slice is a DataFrame object!

In [74]:
type(prices_df[['prices', 'fruits']])

pandas.core.frame.DataFrame

In [75]:
prices_df[ ['fruits','prices'] ]
prices_df

         fruits  prices  suppliers
1        apples     1.5  supplier1
2       oranges     2.0  supplier2
3       bananas     2.5  supplier4
4  strawberries     3.0  supplier3

*Note, that if you want to swap columns using the list indexing will swap only the column names (the labels), but not the corresponding values:*

The way to swap columns with their respective values is discussed bellow

In [76]:
# this will swap only the column labels:
prices_df[['fruits', 'prices']] = prices_df[['prices', 'fruits']]
prices_df

   fruits        prices  suppliers
1     1.5        apples  supplier1
2     2.0       oranges  supplier2
3     2.5       bananas  supplier4
4     3.0  strawberries  supplier3

In [77]:
# let's swap the labels back
prices_df[['fruits', 'prices']] = prices_df[['prices', 'fruits']]
prices_df

         fruits  prices  suppliers
1        apples     1.5  supplier1
2       oranges     2.0  supplier2
3       bananas     2.5  supplier4
4  strawberries     3.0  supplier3

### Access data with the loc method

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html

Access a group of rows and columns by **label**(s) or a boolean array.

**Syntax**: df.loc[row_label,column_label]

In [78]:
# get all rows and the columns 'fruits' and 'prices'
prices_df.loc[ 2, 'fruits' ]

'oranges'

In [79]:
# using internal indexes:
prices_df.iloc[ 1, 0 ]

'oranges'

In [80]:
prices_df

         fruits  prices  suppliers
1        apples     1.5  supplier1
2       oranges     2.0  supplier2
3       bananas     2.5  supplier4
4  strawberries     3.0  supplier3

In [81]:
# get all rows from second to the end 
prices_df.loc[2:, ['fruits', 'prices']]

         fruits  prices
2       oranges     2.0
3       bananas     2.5
4  strawberries     3.0

In [82]:
prices_df.loc[:, 'prices':]

   prices  suppliers
1     1.5  supplier1
2     2.0  supplier2
3     2.5  supplier4
4     3.0  supplier3

#### Transform (swap) columns

In [83]:
# transform a subset of columns - that will swap the data, as well
prices_df.loc[:,['prices','fruits']] = prices_df.loc[:,['fruits', 'prices']]

prices_df

         fruits  prices  suppliers
1        apples     1.5  supplier1
2       oranges     2.0  supplier2
3       bananas     2.5  supplier4
4  strawberries     3.0  supplier3

#### pass Boolean array to loc method

In [84]:
prices_df.loc[ prices_df.prices>2, 'prices' ]

# the same can be done with:
# prices_df[prices_df.prices>2]

3    2.5
4    3.0
Name: prices, dtype: float64

If we have labeled indexes, we can see the real power of loc method. So lets set the fruits column data as index

In [86]:
prices_df.set_index('fruits', inplace=True)
prices_df

KeyError: "None of ['fruits'] are in the columns"

In [87]:
# get the suppliers of all fruits from 'oranges' till the end:
suppliers = prices_df.loc['oranges':, 'suppliers']
print(suppliers)

fruits
oranges         supplier2
bananas         supplier4
strawberries    supplier3
Name: suppliers, dtype: object

In [88]:
# lets reset the index back
prices_df.reset_index(inplace=True)
prices_df

         fruits  prices  suppliers
0        apples     1.5  supplier1
1       oranges     2.0  supplier2
2       bananas     2.5  supplier4
3  strawberries     3.0  supplier3

### Access data with the iloc method

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html

Purely **integer-location** based indexing for selection by position

In [160]:
prices_df

         fruits  prices  suppliers
0        apples     1.5  supplier1
1       oranges     2.0  supplier2
2       bananas     2.5  supplier4
3  strawberries     3.0  supplier3

In [162]:
# get the cell in first row, second column
prices_df.iloc[0,1]

1.5

In [168]:
# get the cells from second row till the end
prices_df.iloc[1:,]

         fruits  prices  suppliers
1       oranges     2.0  supplier2
2       bananas     2.5  supplier4
3  strawberries     3.0  supplier3

In [170]:
# get the cells from second row till the end, ant the last column (using the -1 index)
prices_df.iloc[1:,-1]

1    supplier2
2    supplier4
3    supplier3
Name: suppliers, dtype: object

### Select values

In [34]:
# first select the row, and then - get the value
prices_df.iloc[2,0]

'bananas'

In [158]:
# using the loc method:
prices_df.loc[2,'fruits']

'bananas'